In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('adult.data.csv')

In [333]:
df.head(5)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [ ]:
## Задание 1. Посчитайте, сколько мужчин и женщин (признак sex) представлено в этом датасете

In [172]:
df_1 = df.groupby(by = ['sex'], ).agg({'sex': 'count'})

In [176]:
df_1

          sex
sex
Female  10771
Male    21790

In [177]:
## Задание 2.  Каков средний возраст мужчин (признак age) по всему датасету?

In [185]:
df_2 =  df[df['sex'] =='Male'].agg({'age': 'mean'})

In [186]:
df_2

age    39.433547
dtype: float64

In [ ]:
## Задание 3. Какова доля граждан Соединенных Штатов (признак native-country)?

In [187]:
usa = df[df['native-country']=='United-States'].shape[0]

In [188]:
usa

29170

In [189]:
countries = df.shape[0]

In [190]:
countries

32561

In [191]:
result = round(( usa / countries * 100 ),2)

In [192]:
result

89.59

In [3]:
## Задание 4-5.  Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак salary) и тех,
## кто получает менее 50K в год

In [195]:
salary_low = ['<=50K']

In [199]:
salary_hight = ['>50K']

In [197]:
df_salary_low = df[df['salary']. isin(salary_low)].agg({ 'age': ['mean', 'std']})

In [198]:
df_salary_low

            age
mean  36.783738
std   14.020088

In [200]:
df_salary_hight = df[df['salary']. isin(salary_hight)].agg({ 'age': ['mean', 'std']})

In [201]:
df_salary_hight

            age
mean  44.249841
std   10.519028

In [11]:
## Задание 6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? 
## (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [203]:
education =['Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters','Doctorate']

In [207]:
df[df['salary'] == '>50K'].shape[0] == df[df['salary']=='>50K']. isin(education).shape[0]

True

In [ ]:
## Задание 7. Выведите статистику возраста для каждой расы (признак race) и каждого пола.
## Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Asian-Pac-Islander.

In [41]:
df_4 = df.groupby(['race', 'sex'], )

In [224]:
df_5 = df_4['age'].describe()

In [225]:
df_5.reset_index(inplace=True)

In [211]:
df_5

,race,sex,count,mean,std,min,25%,50%,75%,max
0,Amer-Indian-Eskimo,Female,119.0,37.117647,13.114991,17.0,27.0,36.0,46.00,80.0
1,Amer-Indian-Eskimo,Male,192.0,37.208333,12.049563,17.0,28.0,35.0,45.00,82.0
2,Asian-Pac-Islander,Female,346.0,35.089595,12.300845,17.0,25.0,33.0,43.75,75.0
3,Asian-Pac-Islander,Male,693.0,39.073593,12.883944,18.0,29.0,37.0,46.00,90.0
4,Black,Female,1555.0,37.854019,12.637197,17.0,28.0,37.0,46.00,90.0
5,Black,Male,1569.0,37.682600,12.882612,17.0,27.0,36.0,46.00,90.0
6,Other,Female,109.0,31.678899,11.631599,17.0,23.0,29.0,39.00,74.0
7,Other,Male,162.0,34.654321,11.355531,17.0,26.0,32.0,42.00,77.0
8,White,Female,8642.0,36.811618,14.329093,17.0,25.0,35.0,46.00,90.0
9,White,Male,19174.0,39.652498,13.436029,17.0,29.0,38.0,49.00,90.0

In [235]:
result = df_5[(df_5['race'] == 'Asian-Pac-Islander') & (df_5['sex'] == 'Male')]['max'].values[0]

In [236]:
result

90.0

In [ ]:
## 8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех,
## у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.

In [220]:
all_men = df[df['sex']=='Male']
all_men

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,age_group
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32553,32,Private,116138,Masters,14,Never-married,Tech-support,Not-in-family,Asian-Pac-Islander,Male,0,0,11,Taiwan,<=50K,young
32554,53,Private,321865,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K,adult
32555,22,Private,310152,Some-college,10,Never-married,Protective-serv,Not-in-family,White,Male,0,0,40,United-States,<=50K,young
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K,adult
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K,young

In [196]:
df['marital-status'].unique()

array(['Never-married', 'Married-civ-spouse', 'Divorced',
       'Married-spouse-absent', 'Separated', 'Married-AF-spouse',
       'Widowed'], dtype=object)

In [221]:
married = ['Married-civ-spouse', 'Married-spouse-absent','Married-AF-spouse']

In [222]:
not_married =['Divorced', 'Separated', 'Never-married','Widowed']

In [224]:
married_men = all_men[all_men['marital-status'].isin(married)]

In [234]:
not_married_men = all_men[all_men['marital-status'].isin(not_married)]

In [243]:
rich_married = round(married_men[married_men['salary'] == '>50K'].shape[0] / married_men.shape[0] * 100,2)
print(rich_married,'%')

44.05 %

In [244]:
rich_not__married = round(not_married_men[not_married_men['salary'] == '>50K'].shape[0] / not_married_men.shape[0] * 100,2)
rich_not__married
print(rich_not__married,'%')

8.45 %

In [ ]:
## Задание 9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? 
## Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [245]:
df['hours-per-week'].max()

99

In [267]:
people = df[df['hours-per-week'] == 99]
people.shape[0]

85

In [278]:
rich_people = people[people['salary']=='>50K']

In [279]:
rich_people.shape[0]

25

In [291]:
result = round(rich_people.shape[0]/people.shape[0]*100,2)
print (result, '%')

29.41 %

In [ ]:
## Задание 10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).

In [334]:
df_10 = df.groupby(['native-country', 'salary']).agg({'hours-per-week': 'mean'})

In [335]:
df_10

                       hours-per-week
native-country salary
?              <=50K        40.164760
               >50K         45.547945
Cambodia       <=50K        41.416667
               >50K         40.000000
Canada         <=50K        37.914634
...                               ...
United-States  >50K         45.505369
Vietnam        <=50K        37.193548
               >50K         39.200000
Yugoslavia     <=50K        41.600000
               >50K         49.500000

[82 rows x 1 columns]

In [ ]:
## Задание 11.Сгруппируйте людей по возрастным группам young, adult, retiree, где:
## young соответствует 16-35 лет
## adult - 35-70 лет
## retiree - 70-100 лет

In [73]:
def get_age_group(age):
    if age>=16 and age<=35:
        return 'young'
    if age>35 and age<=70:
        return 'adult'
    if age>70 and age<=100:
        return 'retiree'

In [74]:
df['age_group'] = df['age'].apply(get_age_group)

In [75]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,age_group
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,young

In [120]:
df_11 =df.groupby(['age_group'], as_index=False). count()

In [121]:
df_11.head()

,age_group,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,adult,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096,17096
1,retiree,540,540,540,540,540,540,540,540,540,540,540,540,540,540,540
2,young,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925,14925

In [ ]:
## Задание 12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup),
## а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)

In [122]:
df_11 =df.groupby(['age_group'])['salary'].count()

In [124]:
df_11

age_group
adult      17096
retiree      540
young      14925
Name: salary, dtype: int64

In [125]:
df_12 = df[df['salary'] == '>50K'].groupby(['age_group'])['salary'].count()

In [126]:
df_12

age_group
adult      6042
retiree      94
young      1705
Name: salary, dtype: int64

In [127]:
df_12/df_11

age_group
adult      0.353416
retiree    0.174074
young      0.114238
Name: salary, dtype: float64

In [ ]:
## Задание 14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, 
## которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 
## и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)

In [156]:
df_14 = df.groupby(['occupation'])

In [159]:
df_14['occupation'].count()

occupation
?                    1843
Adm-clerical         3770
Armed-Forces            9
Craft-repair         4099
Exec-managerial      4066
Farming-fishing       994
Handlers-cleaners    1370
Machine-op-inspct    2002
Other-service        3295
Priv-house-serv       149
Prof-specialty       4140
Protective-serv       649
Sales                3650
Tech-support          928
Transport-moving     1597
Name: occupation, dtype: int64

In [169]:
def filter_funk(df):
    return(df['age'].mean()<=40) & (all(df['hours-per-week']>5))

In [170]:
filter_funk

In [171]:
df_14.filter(filter_funk)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,age_group
442,24,Federal-gov,191073,HS-grad,9,Never-married,Armed-Forces,Own-child,White,Male,0,0,40,United-States,<=50K,young
1300,29,Federal-gov,301010,Some-college,10,Never-married,Armed-Forces,Not-in-family,Black,Male,0,0,60,United-States,<=50K,young
14613,39,Federal-gov,227597,HS-grad,9,Never-married,Armed-Forces,Not-in-family,White,Male,0,0,50,United-States,<=50K,adult
16111,24,Federal-gov,287988,Bachelors,13,Never-married,Armed-Forces,Not-in-family,White,Male,0,0,40,United-States,<=50K,young
18034,34,Federal-gov,172716,12th,8,Married-civ-spouse,Armed-Forces,Husband,White,Male,0,0,40,United-States,<=50K,young
18644,23,Federal-gov,163870,Some-college,10,Never-married,Armed-Forces,Other-relative,White,Male,0,0,40,United-States,<=50K,young
18769,30,Federal-gov,76313,HS-grad,9,Married-civ-spouse,Armed-Forces,Other-relative,Amer-Indian-Eskimo,Male,0,0,48,United-States,<=50K,young
25799,46,Federal-gov,344415,Masters,14,Married-civ-spouse,Armed-Forces,Husband,White,Male,0,1887,40,United-States,>50K,adult
32316,23,Federal-gov,173851,HS-grad,9,Never-married,Armed-Forces,Not-in-family,White,Male,0,0,8,United-States,<=50K,young